{"data":{"projects":{"edges":[{"node":{"frontmatter":{"title":"Hand Gesture Contol Wireless Robot","tech":["C","Verilog","Python","OpenCV","Xilinx Nexys","FPGArduino","ESP 8266 WiFi module"],"github":"https://github.com/NishadSaraf/Hand-Gesture-Controlled-Robot","external":""},"html":"<p>Designed an algorithm in Python using OpenCV libraries to detect the number of fingers present in real-time within a predefined contour.</p>\n<p>Devised a fast control system on Xilinx Nexys 4 DDR board, which generates control signals based on the hand gestures captured in real-time.</p>\n<p>Established UART communication between laptop and Nexys board to deliver proper information based on the hand gesture.</p>\n<p>Ported MIPS based Arduino core to Xilinx Nexys4DDR FPGA board and made use of Bridge libraries to virtually map the pins of the robot</p>"}},{"node":{"frontmatter":{"title":"RTOS Driven Closed Loop Control System","tech":["C","Verilog","OpenCV","Xilinx Nexys","XilKernel","Xilinx Vivado","ARMmbed SerialPortPlotter"],"github":"https://github.com/NishadSaraf/RTOS-Driven-Closed-Loop-Control-System","external":""},"html":"<p>Implemented a full PID controller for an electric motor with and without load. Created a custom IP for interfacing PmodHBridge with Nexys FPGA.</p>\n<p>Wrote device drivers for peripheral used which includes PmodHbridge, PmodOLED display, and PmodENC rotary encoder.</p>\n<p>Synthesized hardware for PWM generation and edge detection, for driving the motor and to obtain the actual speed from the pulses generated by Hall effect sensor respectively. AXI bus interface was used to communicate data between the HW blocks and Microblaze CPU.</p>\n<p>Created a multithreaded PID control application that runs on a lightweight real-time operating system “Xilkernel” using IPC mechanisms like semaphore and message queue.</p>"}},{"node":{"frontmatter":{"title":"Vehcile Data Recorder","tech":["AT mega 328 Programming","GSM/GPRS SIM 900A modem","GPS-NEO-6M SD Card Module","Collision sensor","Autodesk 123D Design"],"github":"","external":""},"html":"<p>Developed a real-time monitor for a vehicle, on Arduino Mega 2560(AT mega 328) board. The VDR records various statistics such as speed, distance traveled, fuel\ncapacity, location information, collision detection etc. and stores this information on MMC/ SD card.</p>\n<p>Implemented a routine on vehicle crash, such that the system sends accident alert SMS and the current position of the vehicle to a preprogrammed mobile number\nvia GSM modem</p>"}}]}}}